## [데이터 필터링]
#### - 원하는 데이터를 추출하기 위해서 사용하는 방법
#### - 원하는 데이터 걸러내겠다는 의미
#### - 다양한 조건 검사 진행 => 비교 검사 : ==, 같지 않다 !=, 크다 >, 크거나 같다 >=, 작다 <, 작거나 같다 <=

#### (1) 모듈 로딩

In [38]:
import pandas as pd
import numpy as np

#### (2) 데이터 준비

In [39]:
file = '../DATA/employees.csv'

#### (3) 데이터 저장

In [40]:
empDF = pd.read_csv(file)

In [41]:
'Happy' == 'Happy', "Happy" == 'happy'

(True, False)

#### [문제] 데이터에서 이름이 Maria인 데이터만 추출

In [42]:
print(empDF.columns, empDF.index )

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object') RangeIndex(start=0, stop=1001, step=1)

#### - bool값으로 구성된 데이터 ==> 불린인덱싱(Boolean Indexing)

In [43]:
empDF['First Name'] == 'Maria'

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [44]:
mariaMask = (empDF['First Name'] == 'Maria')

print(type(mariaMask), mariaMask.sum(), sep='\n\n')

<class 'pandas.core.series.Series'>

6

In [45]:
(empDF['First Name'] == 'Maria').sum()

6

In [46]:
empDF[empDF['First Name'] == 'Maria']

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [47]:
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [48]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

#### [문제] employees 데이터에서 연봉이 120000 이상인 사람의 데이터를 추출

In [49]:
empDF['Salary'] >= 120000

0       False
1       False
2        True
3        True
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

In [50]:
salaryMask = (empDF['Salary'] >= 120000)

In [51]:
empDF[salaryMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
9      Frances  Female     8/8/02  139852.0   True  Business Dev
18       Diana  Female   10/23/81  132940.0  False            IT
23         NaN    Male    6/14/12  125792.0    NaN           NaN
..         ...     ...        ...       ...    ...           ...
983       John    Male   12/23/82  146907.0  False   Engineering
987     Gloria  Female    12/8/14  136709.0   True       Finance
991       Rose  Female    8/25/02  134505.0   True     Marketing
995      Henry     NaN   11/23/14  132483.0  False  Distribution
999     Albert    Male    5/15/12  129949.0   True         Sales

[241 rows x 6 columns]

#### [문제] employees 데이터에서 성별이 남자이며 연봉이 100000 이상인 사람의 데이터를 추출

In [52]:
empDF['Gender'] == 'Male'

0        True
1        True
2       False
3       False
4        True
        ...
996      True
997      True
998      True
999      True
1000    False
Name: Gender, Length: 1001, dtype: bool

In [53]:
empDF['Salary']>= 100000

0       False
1       False
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

#### - 여러 개의 조건이 모두 True 여야만 하는 조건 => AND 조건
####    * 문법 : 조건 1 & 조건 2 & 조건 3 & ...& 조건N
####    * 연산자 : & 앰퍼센트
####    * 결과 : True/False

In [58]:
mask=(empDF['Gender'] == 'Male') & (empDF['Salary']>= 148000)
type(mask), mask.sum()

(pandas.core.series.Series, 5)

In [59]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt     Team
83       Shawn   Male    9/23/05  148115.0   True  Finance
318        Roy   Male     8/6/06  148225.0  False  Finance
800   Clarence   Male     8/5/89  148941.0  False  Product
850    Charles   Male     9/3/97  148291.0  False      NaN
981      James   Male    1/15/93  148985.0  False    Legal

#### - 여러 개의 조건 중 1개 이상이 True가 되는 조건 => OR 조건
####    * 문법 : 조건 1 & 조건 2 & 조건 3 & ...& 조건N
####    * 연산자 : | 파이프 ==> 키보드 Enter키 위에 있음
####    * 결과 : True/False

#### [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 매니지먼트가 없는 사람 데이터 조회

In [61]:
empDF['Start Date'] < '1993-01-01'

0       False
1       False
2       False
3       False
4        True
        ...
996      True
997     False
998     False
999     False
1000    False
Name: Start Date, Length: 1001, dtype: bool

In [62]:
empDF['Mgmt'] == False

0       False
1       False
2        True
3       False
4       False
        ...
996      True
997      True
998      True
999     False
1000    False
Name: Mgmt, Length: 1001, dtype: bool

In [63]:
mask1=(empDF['Start Date'] < '1993-01-01') | (empDF['Mgmt'] == False)

In [64]:
empDF[mask1]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
8       Angela  Female   11/22/05   95570.0   True   Engineering
11       Julie  Female   10/26/97  102508.0   True         Legal
..         ...     ...        ...       ...    ...           ...
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev

[640 rows x 6 columns]

In [66]:
pd.to_datetime(empDF['Start Date'])

C:\Users\KDP-26\AppData\Local\Temp\ipykernel_13268\3859360305.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(empDF['Start Date'])

0      1993-08-06
1      1996-03-31
2             NaT
3      2005-03-04
4      1998-01-24
          ...
996    1984-01-31
997    2013-05-20
998    2013-04-20
999    2012-05-15
1000          NaT
Name: Start Date, Length: 1001, dtype: datetime64[ns]

In [69]:
empDF['Start Date'] = pd.to_datetime(empDF['Start Date'], format='%Y-%m-%d')

In [70]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [71]:
(empDF['Team']== 'Sales') | (empDF['Team'] == 'Legal') | (empDF['Team']== 'Marketing')

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [72]:
empDF['Team'].isin(['Sales', 'Legal', 'Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [73]:
empDF[empDF['Team'].isin(['Sales', 'Legal', 'Marketing'])]

    First Name  Gender Start Date    Salary   Mgmt       Team
0      Douglas    Male 1993-08-06       NaN   True  Marketing
5       Dennis    Male 1987-04-18  115163.0  False      Legal
11       Julie  Female 1997-10-26  102508.0   True      Legal
13        Gary    Male 2008-01-27  109831.0  False      Sales
20        Lois     NaN 1995-04-22   64714.0   True      Legal
..         ...     ...        ...       ...    ...        ...
986      Donna  Female 1982-11-26   82871.0  False  Marketing
989     Justin     NaN 1991-02-10   38344.0  False      Legal
991       Rose  Female 2002-08-25  134505.0   True  Marketing
994     George    Male 2013-06-21   98874.0   True  Marketing
999     Albert    Male 2012-05-15  129949.0   True      Sales

[280 rows x 6 columns]

In [74]:
empDF['Salary'].between(80000, 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [75]:
empDF[empDF['Salary'].between(80000, 90000)]

    First Name  Gender Start Date   Salary   Mgmt         Team
19       Donna  Female 2010-07-22  81014.0  False      Product
31       Joyce     NaN 2005-02-20  88657.0  False      Product
35     Theresa  Female 2006-10-10  85182.0  False        Sales
45       Roger    Male 1980-04-17  88010.0   True        Sales
54        Sara  Female 2007-08-15  83677.0  False  Engineering
..         ...     ...        ...      ...    ...          ...
930      Nancy  Female 2001-09-10  85213.0   True    Marketing
956    Beverly  Female 1986-10-17  80838.0  False  Engineering
963        Ann  Female 1994-09-23  89443.0   True        Sales
985    Stephen     NaN 1983-07-10  85668.0  False        Legal
986      Donna  Female 1982-11-26  82871.0  False    Marketing

[94 rows x 6 columns]

In [77]:
(empDF['Salary'] >=  80000) & (empDF['Salary'] <= 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [78]:
empDF[(empDF['Salary'] >=  80000) & (empDF['Salary'] <= 90000)]

    First Name  Gender Start Date   Salary   Mgmt         Team
19       Donna  Female 2010-07-22  81014.0  False      Product
31       Joyce     NaN 2005-02-20  88657.0  False      Product
35     Theresa  Female 2006-10-10  85182.0  False        Sales
45       Roger    Male 1980-04-17  88010.0   True        Sales
54        Sara  Female 2007-08-15  83677.0  False  Engineering
..         ...     ...        ...      ...    ...          ...
930      Nancy  Female 2001-09-10  85213.0   True    Marketing
956    Beverly  Female 1986-10-17  80838.0  False  Engineering
963        Ann  Female 1994-09-23  89443.0   True        Sales
985    Stephen     NaN 1983-07-10  85668.0  False        Legal
986      Donna  Female 1982-11-26  82871.0  False    Marketing

[94 rows x 6 columns]

In [80]:
empDF['First Name'].str.upper(), empDF['First Name']

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object